# IconIndexParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..IconIndexParam Property
ParameterTypeId Class See Also
---
"Index Into Image File Name Array (for Use with XAML)"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId IconIndexParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property IconIndexParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ IconIndexParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace